Modules/WidgetsModule/Repository/SliderRepository.php

  public function update($id, $data, $data_trans)
  {
    $slider = Slider::find($id);
---
select * from `sliders` where `id` = '1' limit 1