Modules/TripModule/Repository/TripCategoryRepository.php

    public function findAll()
    {
        return TripCategory::with(['child', 'translations', 'child.translations'])->get();
---
select * from `trip_category`

    public function findAllParent()
    {
        $parents = TripCategory::with(['child', 'translations', 'child.translations'])->where('parent_id', null)->get();
---
select * from `trip_category` where `trip_category`.`parent_id` in (1, 2, 3)

    public function find($id)
    {
        return TripCategory::where('id', $id)->first();
---
select * from `trip_category` where `id` = '3' limit 1