Modules/TripModule/Repository/TripRepository.php

select * from `trip_photos` where `trip_photos`.`trip_id` in (1)
select * from `trips`
select `destinations`.*, `trip_destination`.`trip_id` as `pivot_trip_id`, `trip_destination`.`destination_id` as `pivot_destination_id` from `destinations` inner join `trip_destination` on `destinations`.`id` = `trip_destination`.`destination_id` where `trip_destination`.`trip_id` in (1)
---
	public function findAll() {
		$trips = Trip::with(['categories', 'categories.translations', 'destinations', 'destinations.translations', 'photos', 'translations'])->get();

select * from `trip_photos` where `trip_photos`.`trip_id` in (1)
select * from `trip_program` where `trip_program`.`trip_id` in (1)
select * from `trips` where `id` = '1' limit 1
---
	public function find($id) {
		return Trip::where('id', $id)->with(['photos', 'translations', 'program'])->first();

select * from `trip_photos` where `trip_photos`.`trip_id` in (1)
select * from `trip_program` where `trip_program`.`trip_id` in (1)
---
	public function findSlug($slug) {
		return Trip::whereTranslation('slug', $slug)->with(['photos', 'translations', 'program'])->first();

insert into `trip_destination` (`destination_id`, `trip_id`) values (1, 4)
---
	public function save($data, $pics, $destination, $categories) {
		$trip = Trip::create($data);
		$trip->destinations()->sync($destination);

insert into `trip_destination` (`destination_id`, `trip_id`) values (1, 1)
---
	public function update($id, $data, $data_trans, $tripDestinations, $tripCategories) {
		$trip = $this->find($id);

		$trip->update($data);
		$trip->destinations()->sync($tripDestinations);