Modules/CommonModule/Helper/LanguageHelper.php

    public static function getLang()
    {
        $lang = Language::where('active', '=', 1)->get();
---
select * from `languages` where `active` = 1

    public function getDynamicLangCode()
    {
        $lang = Language::where('active', '=', 1)->where('lang_type', 1)->get();
---
select * from `languages` where `active` = 1 and `lang_type` = 1